Autodesk.Revit.DB.Mechanical.RiseDropSymbol
Since:
2012
This enumeration corresponds to the rise/drop symbol used
in mechanical systems
Since:
2012

Autodesk.Revit.DB.Mechanical.RiseDropSymbol.ReverseWyeFilled
Duct exhaust rise/drop with /\ pattern and lower right \ is filled

Autodesk.Revit.DB.Mechanical.RiseDropSymbol.WyeFilled
Duct exhaust rise/drop with \/ pattern and lower left / is filled

Autodesk.Revit.DB.Mechanical.RiseDropSymbol.CrossNoOutline
Cable Tray 1 Line a cross without outline

Autodesk.Revit.DB.Mechanical.RiseDropSymbol.TeeFullCircle
Pipe 1 Line junction full circle

Autodesk.Revit.DB.Mechanical.RiseDropSymbol.TeeHalfCircle
Pipe 1 Line junction 1/2 circle on each side

Autodesk.Revit.DB.Mechanical.RiseDropSymbol.BendFullCircle
Pipe 1 Line bend full circle

Autodesk.Revit.DB.Mechanical.RiseDropSymbol.BendThreeQuarterCircle
Pipe 1 Line bend 3/4 circle

Autodesk.Revit.DB.Mechanical.RiseDropSymbol.YinYangFilled
Pipe contour rise/drop and 2 half circles (yin-yang) left side is filled

Autodesk.Revit.DB.Mechanical.RiseDropSymbol.YinYang
Pipe contour rise/drop and 2 half circles (yin-yang)

Autodesk.Revit.DB.Mechanical.RiseDropSymbol.OutlineFilled
Outline only no internal geometry and filled to be solid

Autodesk.Revit.DB.Mechanical.RiseDropSymbol.ReverseWye
Duct exhaust rise/drop with /\ pattern

Autodesk.Revit.DB.Mechanical.RiseDropSymbol.Wye
Duct exhaust rise/drop with \/ pattern

Autodesk.Revit.DB.Mechanical.RiseDropSymbol.BackslashFilled
Duct return rise/drop with \ pattern and lower left \ is filled

Autodesk.Revit.DB.Mechanical.RiseDropSymbol.Backslash
Duct return rise/drop with \ pattern

Autodesk.Revit.DB.Mechanical.RiseDropSymbol.SlashFilled
Duct return rise/drop with / pattern and lower right / is filled

Autodesk.Revit.DB.Mechanical.RiseDropSymbol.Slash
Duct return rise/drop with / pattern

Autodesk.Revit.DB.Mechanical.RiseDropSymbol.CrossFilled
Duct supply rise/drop with X pattern and top and bottom of X is filled

Autodesk.Revit.DB.Mechanical.RiseDropSymbol.Cross
Duct supply rise/drop with X pattern

Autodesk.Revit.DB.Mechanical.RiseDropSymbol.Outline
Outline only no internal geometry

Autodesk.Revit.DB.Mechanical.RiseDropSymbol.NoSymbol
No rise/drop graphics will be used

Autodesk.Revit.DB.Mechanical.RiseDropSymbol.CustomSymbol
A userdefined symbol for rise/drop graphics is used